In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[4,np.nan,np.nan], 'C':[9,7,5]}
#Using a dataframe as a dictionary, In parameter, the keys with assigned values separated by colon
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  4.0  9
1  2.0  NaN  7
2  NaN  NaN  5

In [3]:
df.dropna()
#Same is df.dropna(axis=0)
#drops any row with nan

     A    B  C
0  1.0  4.0  9

In [4]:
df.dropna(axis=1)
#drops any column with nan in it

   C
0  9
1  7
2  5

In [5]:
df.dropna(thresh=2)
#Keep a row with atleast '2' or more NOT nan values

     A    B  C
0  1.0  4.0  9
1  2.0  NaN  7

In [6]:
df.dropna(axis=1, thresh=2)
#Same as above with column

     A  C
0  1.0  9
1  2.0  7
2  NaN  5

In [7]:
df.fillna(value='Fill It Up')
#Replace nan with a value or data,fill it up

            A           B  C
0           1           4  9
1           2  Fill It Up  7
2  Fill It Up  Fill It Up  5

In [8]:
df['A'].fillna(value=df['A'].mean())
#This is for A column
#Filling nan in with the mean of A column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64